---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.ResetOverride
source: html/e8237a01-a089-e4b0-73b3-e90b3b7cea54.htm
---
# Autodesk.Revit.DB.TableCellStyle.ResetOverride Method

Resets any overrides applied to this cell.

## Syntax (C#)
```csharp
public void ResetOverride()
```